Revit 2026 API

# StructuralSectionGeneralUWebToeOfFillet Property

---

Detailing distance from outer face of flange to web toe of fillet, in. (mm)

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WebToeOfFillet { get; set; }
```
```vb
Public Property WebToeOfFillet As Double
	Get
	Set
```
```cpp
public:
property double WebToeOfFillet {
	double get ();
	void set (double value);
}
```
```fsharp
member WebToeOfFillet : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralU Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace